Revit 2027 API
BuiltInFailures.RegenFailures.CircularDependencyUncut Property
 There is a circular chain of references among the highlighted elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircularDependencyUncut { get; }
Public Shared ReadOnly Property CircularDependencyUncut As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircularDependencyUncut {
	FailureDefinitionId^ get ();
}
static member CircularDependencyUncut : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace